src/cf/Documents/bon_ВводВОборотНоминальныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>bon_ВводВОборотНоминальныхОбъектов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.bon_СостоянияНоминальныхОбъектов</xr:Item>
				<xr:Item>InformationRegister.bon_СведенияОНоминальныхОбъектах</xr:Item>
				<xr:Item>AccumulationRegister.bon_ПартииБонусовНаСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоминальныхОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_ВидыНоминальныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействияКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоминальныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальныйОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.bon_ХарактеристикиБонусов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Держатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/bon_ТелефоныНомОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_ТелефоныНомОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотовый</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>bon_НоминальныеОбъекты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагенты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/bon_СведенияОНоминальныхОбъектах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_СведенияОНоминальныхОбъектах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НоминальныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодДействияКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Держатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/bon_СостоянияНоминальныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_СостоянияНоминальныхОбъектов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bon_СтатусыНоминальныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоминальныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/bon_СтатусыНоминальныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>bon_СтатусыНоминальныхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВведенВОборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборота</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/bon_ВводВОборотНоминальныхОбъектов/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Перем Заголовок;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Заголовок = "Проверка заполнения документа: ";
		// проверим заполнение обязательных полей ТЧ
		СтруктураОбязательныхПолей = Новый Структура("Номер");
		
		Если НЕ ВидНоминальныхОбъектов.НакапливаемыйНоминал Тогда
			СтруктураОбязательныхПолей.Вставить("Номинал");		
		КонецЕсли;
				
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		// досоздадим номинальные объекты
		Для каждого стрТЧ Из НоминальныеОбъекты Цикл
			Если НЕ ЗначениеЗаполнено(стрТЧ.НоминальныйОбъект) Тогда
				// сначало ищем в справочнике по номеру
				//ПоискЭлемента = Справочники.bon_НоминальныеОбъекты.НайтиПоКоду(стрТЧ.Номер);
				ПоискЭлемента = ПоискПоНомеру(стрТЧ.Номер);
							
				Если ПоискЭлемента.Ссылка.Пустая() Тогда
					// создадим если не нашли
					спр = Справочники.bon_НоминальныеОбъекты.СоздатьЭлемент();
					//спр.Код 	 			= стрТЧ.Номер;
					спр.Владелец 			= ВидНоминальныхОбъектов;
					спр.Наименование		= Строка("Бонусный Счет " + стрТЧ.Номер);
					спр.Записать();
					ПоискЭлемента = спр.Ссылка;
					
					/////
					МенеджерЗаписи = РегистрыСведений.bon_ТелефоныНомОбъектов.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Сотовый 				  = стрТЧ.Номер;  
					Если  ПоискЭлемента <> Справочники.bon_НоминальныеОбъекты.ПустаяСсылка() Тогда
						ОсновНомер = ПроверкаЕслиОсновной(ПоискЭлемента);		
					Иначе 
						ОсновНомер = Истина;	
					КонецЕсли;
					
					ОсновНомер = ПроверкаЕслиОсновной(Спр.Ссылка);

					МенеджерЗаписи.Основной 			  = ОсновНомер;
					МенеджерЗаписи.bon_НоминальныеОбъекты = ПоискЭлемента;
					МенеджерЗаписи.Записать();
					
				ИначеЕсли ПоискЭлемента.ПометкаУдаления Тогда
					// снимем пометку удаления
					спр = ПоискЭлемента.ПолучитьОбъект();
					спр.ПометкаУдаления = Ложь;			
					спр.Записать();	
					ПоискЭлемента = спр.Ссылка;		
				КонецЕсли; 
				стрТЧ.НоминальныйОбъект = ПоискЭлемента;	
			КонецЕсли; 	
		КонецЦикла;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 			
		// пометим на удаление все номинальные объекты	
	КонецЕсли; 
	
	Попытка 	
		Для Каждого ТекСтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл
			Попытка
				Спр = ТекСтрокаНоминальныеОбъекты.НоминальныйОбъект.ПолучитьОбъект();
				Если СОкрЛП(Спр.Держатель) = "" Тогда 
					Спр.Держатель = ТекСтрокаНоминальныеОбъекты.Держатель;
				КонецЕсли;
				Спр.Записать();	
				
				/////
				ПоискЭлемента = ПоискПоНомеру(ТекСтрокаНоминальныеОбъекты.Номер);	
				Если ПоискЭлемента.Ссылка.Пустая() Тогда
					МенеджерЗаписи = РегистрыСведений.bon_ТелефоныНомОбъектов.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Сотовый 				  = ТекСтрокаНоминальныеОбъекты.Номер;
					ОсновНомер = ПроверкаЕслиОсновной(Спр.Ссылка);
					МенеджерЗаписи.Основной 			  = ОсновНомер;
					МенеджерЗаписи.bon_НоминальныеОбъекты = Спр.Ссылка;
					МенеджерЗаписи.Контрагенты 			  = Спр.Держатель;
					МенеджерЗаписи.Записать();
				КонецЕсли;
				
			Исключение
				описание = ОписаниеОшибки();		
			КонецПопытки;	
		КонецЦикла;	
	Исключение
		описание = ОписаниеОшибки();
	КонецПопытки; 

		
КонецПроцедуры

&НаСервере
Функция ПроверкаЕслиОсновной(Номенальный)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	bon_ТелефоныНомОбъектов.Основной КАК Основной
	|ИЗ
	|	РегистрСведений.bon_ТелефоныНомОбъектов КАК bon_ТелефоныНомОбъектов
	|ГДЕ
	|	bon_ТелефоныНомОбъектов.bon_НоминальныеОбъекты = &bon_НоминальныеОбъекты
	|	И bon_ТелефоныНомОбъектов.Основной = ИСТИНА";
	Запрос.УстановитьПараметр("bon_НоминальныеОбъекты",Номенальный); 
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Возврат Ложь;	
	Иначе 
		Возврат Истина;	
	КонецЕсли;
КонецФункции

Функция ПоискПоНомеру(Номер) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	bon_ТелефоныНомОбъектов.bon_НоминальныеОбъекты КАК bon_НоминальныеОбъекты
	|ИЗ
	|	РегистрСведений.bon_ТелефоныНомОбъектов КАК bon_ТелефоныНомОбъектов
	|ГДЕ
	|	bon_ТелефоныНомОбъектов.Сотовый = &Сотовый
	|
	|СГРУППИРОВАТЬ ПО
	|	bon_ТелефоныНомОбъектов.bon_НоминальныеОбъекты";
	Запрос.УстановитьПараметр("Сотовый",Номер);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 тогда
		ПоискЭлемента = Рез[0].bon_НоминальныеОбъекты;
	Иначе 
		ПоискЭлемента = Справочники.bon_НоминальныеОбъекты.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат ПоискЭлемента;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ма_СведенияОНоминальныхОбъектах
	Движения.bon_СведенияОНоминальныхОбъектах.Записывать = Истина;
	Движения.bon_СведенияОНоминальныхОбъектах.Очистить();
	
	Для Каждого ТекСтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл
		
		Движение = Движения.bon_СведенияОНоминальныхОбъектах.Добавить();
		
		Движение.Период 				= НачалоДня(Дата);
		Движение.Номер 					= ТекСтрокаНоминальныеОбъекты.Номер;
		Движение.НоминальныйОбъект 		= ТекСтрокаНоминальныеОбъекты.НоминальныйОбъект;
		Движение.Держатель			 	= ТекСтрокаНоминальныеОбъекты.Держатель;
		Движение.ПериодДействияНачало 	= ПериодДействияНачало;
		Движение.ПериодДействияКонец 	= ПериодДействияКонец;
		Движение.Автор 					= Автор;
		Движение.Подразделение			= Подразделение; 		
	КонецЦикла;

	// регистр ма_СостоянияНоминальныхОбъектов
	Движения.bon_СостоянияНоминальныхОбъектов.Записывать = Истина;
	Движения.bon_СостоянияНоминальныхОбъектов.Очистить();
	
	Для Каждого ТекСтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл
		
		Движение = Движения.bon_СостоянияНоминальныхОбъектов.Добавить();
		Движение.Период 				= Дата; 
		Движение.Номер 					= ТекСтрокаНоминальныеОбъекты.Номер;
		Движение.НоминальныйОбъект 		= ТекСтрокаНоминальныеОбъекты.НоминальныйОбъект;
		Движение.Статус 				= Перечисления.bon_СтатусыНоминальныхОбъектов.ВведенВОборот;
		
	КонецЦикла;
	

	///Движение ввода по бонусам
	Если ВидНоминальныхОбъектов.Наименование = Строка("Акционные Сертификаты") или ВидНоминальныхОбъектов.Наименование = Строка("Подарочный сертификат") Тогда
		bon_БонуснаяПрограммаСервер.ПоступлениеСертификатовВрем(ЭтотОбъект, НоминальныеОбъекты);
	КонецЕсли;
	
	Если ВидНоминальныхОбъектов.Наименование = Строка("Бонусные счета") или ВидНоминальныхОбъектов.Наименование = Строка("Накопительные карты") Тогда
		bon_БонуснаяПрограммаСервер.ВводВОборотБонусныйСчетСНоменалом(ЭтотОбъект, НоминальныеОбъекты);
	КонецЕсли;
	///---

КонецПроцедуры
